app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT * FROM `users`

  def show
    @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 980190962)

  def edit
    @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 980190962)

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`name`, `address`, `created_at`, `updated_at`, `about`, `phone`, `email`) VALUES('some name', NULL, '2010-07-02 06:59:06', '2010-07-02 06:59:06', NULL, 123, 'some@time.com')

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT * FROM `users` WHERE (`users`.`id` = 980190962)
UPDATE `users` SET `phone` = 123, `updated_at` = '2010-07-02 07:14:58', `name` = 'some name', `email` = 'some@time.com' WHERE `id` = 980190962

  def destroy
    @user = User.find(params[:id])
    @user.destroy
---
SELECT * FROM `users` WHERE (`users`.`id` = 980190962)
DELETE FROM `users` WHERE `id` = 980190962